# 4. Напишите программу, которая будет преобразовывать десятичное число в двоичное

n = int(input('введите чсло '))
res = bin(n)
print(res[2:])
